Tests seems to be working fine.

#### Show OpenTofu / Terraform versions

```bash
$ tofu --version 
OpenTofu v1.11.2
on linux_amd64

$ terraform --version     # I don't have terraform
zsh: command not found: terraform
```

#### Plan

```bash
$ TERRAFORM=tofu ../terraformsh plan
../terraformsh: Info: Found tofu command 'plan'
../terraformsh: Warning: No -b option passed! Potentially using only local state.

+ tofu init -input=false -reconfigure -force-copy

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!
+ tofu get -update=true
+ tofu validate
Success! The configuration is valid.
+ tofu plan -input=false -out=/home/thomas/github/Th0masL/terraformsh/test_stack/tf.fb7eac8ae2.plan

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_iam_user.test_user will be created
  + resource "aws_iam_user" "test_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "terraform-test-user"
      + path          = "/"
      + tags          = {
          + "Purpose" = "Terraform test"
        }
      + tags_all      = {
          + "Purpose" = "Terraform test"
        }
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + created_user = "terraform-test-user"
```

#### Apply

```bash
$ TERRAFORM=tofu ../terraformsh apply     
../terraformsh: Info: Found tofu command 'apply'
../terraformsh: Warning: No -b option passed! Potentially using only local state.

+ tofu init -input=false -reconfigure -force-copy

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!
+ tofu apply -input=false /home/thomas/github/Th0masL/terraformsh/test_stack/tf.fb7eac8ae2.plan
aws_iam_user.test_user: Creating...
aws_iam_user.test_user: Creation complete after 0s [id=terraform-test-user]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

created_user = "terraform-test-user"
```

#### Plan Destroy

```bash
$ TERRAFORM=tofu ../terraformsh plan_destroy
../terraformsh: Info: Found tofu command 'plan_destroy'
../terraformsh: Warning: No -b option passed! Potentially using only local state.

+ tofu init -input=false -reconfigure -force-copy

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!
+ tofu get -update=true
+ tofu validate
Success! The configuration is valid.
+ tofu plan -destroy -input=false -out=/home/thomas/github/Th0masL/terraformsh/test_stack/tf-destroy.fb7eac8ae2.plan
aws_iam_user.test_user: Refreshing state... [id=terraform-test-user]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

OpenTofu will perform the following actions:

  # aws_iam_user.test_user will be destroyed
  - resource "aws_iam_user" "test_user" {
      - arn           = "arn:aws:iam::<REDACTED>:user/terraform-test-user" -> null
      - force_destroy = false -> null
      - id            = "terraform-test-user" -> null
      - name          = "terraform-test-user" -> null
      - path          = "/" -> null
      - tags          = {
          - "Purpose" = "Terraform test"
        } -> null
      - tags_all      = {
          - "Purpose" = "Terraform test"
        } -> null
      - unique_id     = "<REDACTED>" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - created_user = "terraform-test-user" -> null
```

#### Destroy

```bash
$ TERRAFORM=tofu ../terraformsh destroy     
../terraformsh: Info: Found tofu command 'destroy'
../terraformsh: Warning: No -b option passed! Potentially using only local state.

+ tofu init -input=false -reconfigure -force-copy

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!
+ tofu apply -input=false /home/thomas/github/Th0masL/terraformsh/test_stack/tf-destroy.fb7eac8ae2.plan
aws_iam_user.test_user: Destroying... [id=terraform-test-user]
aws_iam_user.test_user: Destruction complete after 1s

Apply complete! Resources: 0 added, 0 changed, 1 destroyed.
```
